<?php


return [

	// +----------------------------------------------------------------------
	// | URL设置
	// +----------------------------------------------------------------------
	
	// 是否开启路由
    'url_route_on'           => false,
    // 是否强制使用路由,(开启可使miss路由生效)
    'url_route_must'         => false,
 
	// +----------------------------------------------------------------------
    // | 模块设置
    // +----------------------------------------------------------------------

    // 默认模块名
    'default_module'         => 'admin',
    // 默认控制器名
    'default_controller'     => 'Index',
    // 默认操作名
    'default_action'         => 'index',

    // +----------------------------------------------------------------------
    // | 模板设置
    // +----------------------------------------------------------------------
    'template'               => [
        // 模板路径
        'view_path'    => ROOT_PATH.'public'.DS.'template'.DS,
        //布局模板配置
        'layout_on'   => true,
        'layout_name'   => 'layouts/admin_layout',
        'layout_item'   =>  '{__CONTENT__}',
    ],

];
