<?php
//配置文件
return [
	// +----------------------------------------------------------------------
    // | 模块设置
    // +----------------------------------------------------------------------
    
    // 默认模块名
    'default_module'         => 'api',
    // 默认控制器名
    'default_controller'     => 'V1',
    // 默认操作名
    'default_action'         => 'index',


    // +----------------------------------------------------------------------
    // | 模板设置
    // +----------------------------------------------------------------------
    'template'               => [
    	// 模板路径
        'view_path'    => ROOT_PATH.'public'.DS.'template'.DS.'api'.DS,
        //布局模板配置
        'layout_on'   => true,
        'layout_name'   => '../layouts/api_layout',
        'layout_item'   =>  '{__CONTENT__}',
    ],

];